// Коментарии на js

/*
Коментарии в JavaScript можно использовать для пояснения кода и повышения 
его читаьельности.

Коментарии в JavaScript также можно использовать для предотвращения выаолнения
кода при тестировании альтернативного кода.
*/

// Однострочные коментарии

/*
Однострочные еоментарии начинаются с //.

Любой текст между // и концом строки ьудет проигнорирован.
*/ 

// this is a calculator:
let a = 12;
let b = 2 ;
let c = a + b 
console.log('the answer is = ' + c)

// Многострочные коментарии:
/*  */ 


/*
Чаще всегно используются однострочные коментарии.
Многострочные коментарии часто используются для офицалной 
документации.
*/



// Использование коментариев для предотврашения выполнения кода.
/*
Использование комментариев для предотврашения выполнения кода подходит 
для тестирования кода.

Добавление // перед строкой кода превращет исполняемую строку в коментарий.

*/

// console.log('hwllo worlf')


