// Условные обозначения JavaScript
/*
Условные обозначения позволяют нам выполнить различные дейтсвия при 
различных условиях. 

Условные операторы выполняют разный код в зависимости от истинных или ложных 
условий.

К условиям оператора относятся:

if
if..else
if...else if...else
switch 
тернарный оператор ( ? :)
*/


// Когда следует испольщовать Условные обозначения.
/*
Используйте if для указания блока кода , который должен быть выполнен ,
если указанное условие выполняется 'true'

Используйте 'else' для указания блока кода который должен быть выполнен,
елси выполняется то же условие false.

Используйте else if , чтобы указать новое условие для тестирования 
если первое условие равно 'false'.

Ипользуйте switch чтобы указать множество альтернативных блоков кода для
выполнения.

Испольщуйте ( ? : ) (троичный) в качестве сокращения для if ... else. 
*/

// Оператор if
/* используйте if для указания блока кода который выполнен , если указанное 
условие true.
*/ 

if (6 > 5) {
    
}   // true


// Оператор else 
/*
Используйте 'else' для указания блока кода , который будет выполнен , если 
выполняется то же условие что и 'false'
*/

if (5 < 4) {

} else {

}